aehoppe/E70N19_Dev_Board/atsame70n19/include/instance/xdmac.h
#define REG_XDMAC_CDS_MSP14     (0x400783FC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 14 */
#define REG_XDMAC_CSUS14        (0x40078400) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 14 */
#define REG_XDMAC_CDUS14        (0x40078404) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 14 */
#define REG_XDMAC_CIE15         (0x40078410) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 15 */
#define REG_XDMAC_CID15         (0x40078414) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 15 */
#define REG_XDMAC_CIM15         (0x40078418) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 15 */
#define REG_XDMAC_CIS15         (0x4007841C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 15 */
#define REG_XDMAC_CSA15         (0x40078420) /**< (XDMAC) Channel Source Address Register (chid = 0) 15 */
#define REG_XDMAC_CDA15         (0x40078424) /**< (XDMAC) Channel Destination Address Register (chid = 0) 15 */
#define REG_XDMAC_CNDA15        (0x40078428) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 15 */
#define REG_XDMAC_CNDC15        (0x4007842C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 15 */
#define REG_XDMAC_CUBC15        (0x40078430) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 15 */
#define REG_XDMAC_CBC15         (0x40078434) /**< (XDMAC) Channel Block Control Register (chid = 0) 15 */
#define REG_XDMAC_CC15          (0x40078438) /**< (XDMAC) Channel Configuration Register (chid = 0) 15 */
#define REG_XDMAC_CDS_MSP15     (0x4007843C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 15 */
#define REG_XDMAC_CSUS15        (0x40078440) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 15 */
#define REG_XDMAC_CDUS15        (0x40078444) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 15 */
#define REG_XDMAC_CIE16         (0x40078450) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 16 */
#define REG_XDMAC_CID16         (0x40078454) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 16 */
#define REG_XDMAC_CIM16         (0x40078458) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 16 */
#define REG_XDMAC_CIS16         (0x4007845C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 16 */
#define REG_XDMAC_CSA16         (0x40078460) /**< (XDMAC) Channel Source Address Register (chid = 0) 16 */
#define REG_XDMAC_CDA16         (0x40078464) /**< (XDMAC) Channel Destination Address Register (chid = 0) 16 */
#define REG_XDMAC_CNDA16        (0x40078468) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 16 */
#define REG_XDMAC_CNDC16        (0x4007846C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 16 */
#define REG_XDMAC_CUBC16        (0x40078470) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 16 */
#define REG_XDMAC_CBC16         (0x40078474) /**< (XDMAC) Channel Block Control Register (chid = 0) 16 */
#define REG_XDMAC_CC16          (0x40078478) /**< (XDMAC) Channel Configuration Register (chid = 0) 16 */
#define REG_XDMAC_CDS_MSP16     (0x4007847C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 16 */
#define REG_XDMAC_CSUS16        (0x40078480) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 16 */
#define REG_XDMAC_CDUS16        (0x40078484) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 16 */
#define REG_XDMAC_CIE17         (0x40078490) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 17 */
#define REG_XDMAC_CID17         (0x40078494) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 17 */
#define REG_XDMAC_CIM17         (0x40078498) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 17 */
#define REG_XDMAC_CIS17         (0x4007849C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 17 */
#define REG_XDMAC_CSA17         (0x400784A0) /**< (XDMAC) Channel Source Address Register (chid = 0) 17 */
#define REG_XDMAC_CDA17         (0x400784A4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 17 */
#define REG_XDMAC_CNDA17        (0x400784A8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 17 */
#define REG_XDMAC_CNDC17        (0x400784AC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 17 */
#define REG_XDMAC_CUBC17        (0x400784B0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 17 */
#define REG_XDMAC_CBC17         (0x400784B4) /**< (XDMAC) Channel Block Control Register (chid = 0) 17 */
#define REG_XDMAC_CC17          (0x400784B8) /**< (XDMAC) Channel Configuration Register (chid = 0) 17 */
#define REG_XDMAC_CDS_MSP17     (0x400784BC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 17 */
#define REG_XDMAC_CSUS17        (0x400784C0) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 17 */
#define REG_XDMAC_CDUS17        (0x400784C4) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 17 */
#define REG_XDMAC_CIE18         (0x400784D0) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 18 */
#define REG_XDMAC_CID18         (0x400784D4) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 18 */
#define REG_XDMAC_CIM18         (0x400784D8) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 18 */
#define REG_XDMAC_CIS18         (0x400784DC) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 18 */
#define REG_XDMAC_CSA18         (0x400784E0) /**< (XDMAC) Channel Source Address Register (chid = 0) 18 */
#define REG_XDMAC_CDA18         (0x400784E4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 18 */
#define REG_XDMAC_CNDA18        (0x400784E8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 18 */
#define REG_XDMAC_CNDC18        (0x400784EC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 18 */
#define REG_XDMAC_CUBC18        (0x400784F0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 18 */
#define REG_XDMAC_CBC18         (0x400784F4) /**< (XDMAC) Channel Block Control Register (chid = 0) 18 */
#define REG_XDMAC_CC18          (0x400784F8) /**< (XDMAC) Channel Configuration Register (chid = 0) 18 */
#define REG_XDMAC_CDS_MSP18     (0x400784FC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 18 */
#define REG_XDMAC_CSUS18        (0x40078500) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 18 */
#define REG_XDMAC_CDUS18        (0x40078504) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 18 */
#define REG_XDMAC_CIE19         (0x40078510) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 19 */
#define REG_XDMAC_CID19         (0x40078514) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 19 */
#define REG_XDMAC_CIM19         (0x40078518) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 19 */
#define REG_XDMAC_CIS19         (0x4007851C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 19 */
#define REG_XDMAC_CSA19         (0x40078520) /**< (XDMAC) Channel Source Address Register (chid = 0) 19 */
#define REG_XDMAC_CDA19         (0x40078524) /**< (XDMAC) Channel Destination Address Register (chid = 0) 19 */
#define REG_XDMAC_CNDA19        (0x40078528) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 19 */
#define REG_XDMAC_CNDC19        (0x4007852C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 19 */
#define REG_XDMAC_CUBC19        (0x40078530) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 19 */
#define REG_XDMAC_CBC19         (0x40078534) /**< (XDMAC) Channel Block Control Register (chid = 0) 19 */
#define REG_XDMAC_CC19          (0x40078538) /**< (XDMAC) Channel Configuration Register (chid = 0) 19 */
#define REG_XDMAC_CDS_MSP19     (0x4007853C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 19 */
#define REG_XDMAC_CSUS19        (0x40078540) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 19 */
#define REG_XDMAC_CDUS19        (0x40078544) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 19 */
#define REG_XDMAC_CIE20         (0x40078550) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 20 */
#define REG_XDMAC_CID20         (0x40078554) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 20 */
#define REG_XDMAC_CIM20         (0x40078558) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 20 */
#define REG_XDMAC_CIS20         (0x4007855C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 20 */
#define REG_XDMAC_CSA20         (0x40078560) /**< (XDMAC) Channel Source Address Register (chid = 0) 20 */
#define REG_XDMAC_CDA20         (0x40078564) /**< (XDMAC) Channel Destination Address Register (chid = 0) 20 */
#define REG_XDMAC_CNDA20        (0x40078568) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 20 */
#define REG_XDMAC_CNDC20        (0x4007856C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 20 */
#define REG_XDMAC_CUBC20        (0x40078570) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 20 */
#define REG_XDMAC_CBC20         (0x40078574) /**< (XDMAC) Channel Block Control Register (chid = 0) 20 */
#define REG_XDMAC_CC20          (0x40078578) /**< (XDMAC) Channel Configuration Register (chid = 0) 20 */
#define REG_XDMAC_CDS_MSP20     (0x4007857C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 20 */
#define REG_XDMAC_CSUS20        (0x40078580) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 20 */
#define REG_XDMAC_CDUS20        (0x40078584) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 20 */
#define REG_XDMAC_CIE21         (0x40078590) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 21 */
#define REG_XDMAC_CID21         (0x40078594) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 21 */
#define REG_XDMAC_CIM21         (0x40078598) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 21 */
#define REG_XDMAC_CIS21         (0x4007859C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 21 */
#define REG_XDMAC_CSA21         (0x400785A0) /**< (XDMAC) Channel Source Address Register (chid = 0) 21 */
#define REG_XDMAC_CDA21         (0x400785A4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 21 */
#define REG_XDMAC_CNDA21        (0x400785A8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 21 */
#define REG_XDMAC_CNDC21        (0x400785AC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 21 */
#define REG_XDMAC_CUBC21        (0x400785B0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 21 */
#define REG_XDMAC_CBC21         (0x400785B4) /**< (XDMAC) Channel Block Control Register (chid = 0) 21 */
#define REG_XDMAC_CC21          (0x400785B8) /**< (XDMAC) Channel Configuration Register (chid = 0) 21 */
#define REG_XDMAC_CDS_MSP21     (0x400785BC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 21 */
#define REG_XDMAC_CSUS21        (0x400785C0) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 21 */
#define REG_XDMAC_CDUS21        (0x400785C4) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 21 */
#define REG_XDMAC_CIE22         (0x400785D0) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 22 */
#define REG_XDMAC_CID22         (0x400785D4) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 22 */
#define REG_XDMAC_CIM22         (0x400785D8) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 22 */
#define REG_XDMAC_CIS22         (0x400785DC) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 22 */
#define REG_XDMAC_CSA22         (0x400785E0) /**< (XDMAC) Channel Source Address Register (chid = 0) 22 */
#define REG_XDMAC_CDA22         (0x400785E4) /**< (XDMAC) Channel Destination Address Register (chid = 0) 22 */
#define REG_XDMAC_CNDA22        (0x400785E8) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 22 */
#define REG_XDMAC_CNDC22        (0x400785EC) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 22 */
#define REG_XDMAC_CUBC22        (0x400785F0) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 22 */
#define REG_XDMAC_CBC22         (0x400785F4) /**< (XDMAC) Channel Block Control Register (chid = 0) 22 */
#define REG_XDMAC_CC22          (0x400785F8) /**< (XDMAC) Channel Configuration Register (chid = 0) 22 */
#define REG_XDMAC_CDS_MSP22     (0x400785FC) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 22 */
#define REG_XDMAC_CSUS22        (0x40078600) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 22 */
#define REG_XDMAC_CDUS22        (0x40078604) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 22 */
#define REG_XDMAC_CIE23         (0x40078610) /**< (XDMAC) Channel Interrupt Enable Register (chid = 0) 23 */
#define REG_XDMAC_CID23         (0x40078614) /**< (XDMAC) Channel Interrupt Disable Register (chid = 0) 23 */
#define REG_XDMAC_CIM23         (0x40078618) /**< (XDMAC) Channel Interrupt Mask Register (chid = 0) 23 */
#define REG_XDMAC_CIS23         (0x4007861C) /**< (XDMAC) Channel Interrupt Status Register (chid = 0) 23 */
#define REG_XDMAC_CSA23         (0x40078620) /**< (XDMAC) Channel Source Address Register (chid = 0) 23 */
#define REG_XDMAC_CDA23         (0x40078624) /**< (XDMAC) Channel Destination Address Register (chid = 0) 23 */
#define REG_XDMAC_CNDA23        (0x40078628) /**< (XDMAC) Channel Next Descriptor Address Register (chid = 0) 23 */
#define REG_XDMAC_CNDC23        (0x4007862C) /**< (XDMAC) Channel Next Descriptor Control Register (chid = 0) 23 */
#define REG_XDMAC_CUBC23        (0x40078630) /**< (XDMAC) Channel Microblock Control Register (chid = 0) 23 */
#define REG_XDMAC_CBC23         (0x40078634) /**< (XDMAC) Channel Block Control Register (chid = 0) 23 */
#define REG_XDMAC_CC23          (0x40078638) /**< (XDMAC) Channel Configuration Register (chid = 0) 23 */
#define REG_XDMAC_CDS_MSP23     (0x4007863C) /**< (XDMAC) Channel Data Stride Memory Set Pattern (chid = 0) 23 */
#define REG_XDMAC_CSUS23        (0x40078640) /**< (XDMAC) Channel Source Microblock Stride (chid = 0) 23 */
#define REG_XDMAC_CDUS23        (0x40078644) /**< (XDMAC) Channel Destination Microblock Stride (chid = 0) 23 */
#define REG_XDMAC_GTYPE         (0x40078000) /**< (XDMAC) Global Type Register */
#define REG_XDMAC_GCFG          (0x40078004) /**< (XDMAC) Global Configuration Register */
#define REG_XDMAC_GWAC          (0x40078008) /**< (XDMAC) Global Weighted Arbiter Configuration Register */
#define REG_XDMAC_GIE           (0x4007800C) /**< (XDMAC) Global Interrupt Enable Register */
#define REG_XDMAC_GID           (0x40078010) /**< (XDMAC) Global Interrupt Disable Register */
#define REG_XDMAC_GIM           (0x40078014) /**< (XDMAC) Global Interrupt Mask Register */
#define REG_XDMAC_GIS           (0x40078018) /**< (XDMAC) Global Interrupt Status Register */
#define REG_XDMAC_GE            (0x4007801C) /**< (XDMAC) Global Channel Enable Register */
#define REG_XDMAC_GD            (0x40078020) /**< (XDMAC) Global Channel Disable Register */
#define REG_XDMAC_GS            (0x40078024) /**< (XDMAC) Global Channel Status Register */
#define REG_XDMAC_GRS           (0x40078028) /**< (XDMAC) Global Channel Read Suspend Register */
#define REG_XDMAC_GWS           (0x4007802C) /**< (XDMAC) Global Channel Write Suspend Register */
#define REG_XDMAC_GRWS          (0x40078030) /**< (XDMAC) Global Channel Read Write Suspend Register */
#define REG_XDMAC_GRWR          (0x40078034) /**< (XDMAC) Global Channel Read Write Resume Register */
#define REG_XDMAC_GSWR          (0x40078038) /**< (XDMAC) Global Channel Software Request Register */
#define REG_XDMAC_GSWS          (0x4007803C) /**< (XDMAC) Global Channel Software Request Status Register */
#define REG_XDMAC_GSWF          (0x40078040) /**< (XDMAC) Global Channel Software Flush Request Register */

#else

